2024-1-20/d7ad64af74-TODO.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 16:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IRQ总结</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">IRQ总结</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdef8373">1. OF-dts对interrupt-map/parent的解析</a></li>
<li><a href="#orgf576891">2. 通用接口层</a></li>
</ul>
</div>
</div>
<p>
<a href="http://www.wowotech.net/linux_kenrel/irq-domain.html">http://www.wowotech.net/linux_kenrel/irq-domain.html</a>
从架构层到通用层，通用层的接口：int generic_handle_irq(unsigned int irq)
因此，架构层需要从硬件那里获取到hwirq，并对应到irq上。
</p>

<p>
在不同发展时期，这个对应过程也具有不同的处理方式：
最开始只有一个中断控制器时，可以irq == hwirq
再到多个中断控制器并联，需要hwirq + 代表中断控制器实例的irqchip标识寻找到唯一irq
并且当多个中断控制器串联时，就出现了专门管理hwieq --&gt; irq的实例，irq_domain
</p>

<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">LIST_HEAD</span>(<span style="font-weight: bold; font-style: italic;">irq_domain_list</span>); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#20018;&#32852;&#35768;&#22810;irq_domain</span>

  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#36127;&#36131;&#31649;&#29702;hwirq --&gt; irq&#30340;&#26144;&#23556;&#65292;&#26550;&#26500;&#23618;&#20250;&#36890;&#36807;irq_domain_list&#36941;&#21382;&#33719;&#21462;&#26144;&#23556;</span>
  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">irq_domain</span> {
          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">list_head</span>              <span style="font-weight: bold; font-style: italic;">link</span>;
          <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span>                    *<span style="font-weight: bold; font-style: italic;">name</span>; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#20013;&#26029;&#22495;&#21517;</span>
          <span style="font-weight: bold;">const</span> <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">irq_domain_ops</span>   *<span style="font-weight: bold; font-style: italic;">ops</span>;  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">irq_domain&#30340;&#26041;&#27861;</span>
          <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span>                  <span style="font-weight: bold; font-style: italic;">flags</span>;
          <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span>                  <span style="font-weight: bold; font-style: italic;">mapcount</span>; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#26144;&#23556;&#30340;&#20013;&#26029;&#25968;&#37327;</span>
          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">irq_domain</span>             *<span style="font-weight: bold; font-style: italic;">root</span>;    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#25351;&#21521;&#26681;&#22495;&#65292;&#29992;&#20110;&#20018;&#32852;&#38454;&#23618;</span>

          <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Optional data</span><span style="font-weight: bold; font-style: italic;"> */</span>
          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">fwnode_handle</span>          *<span style="font-weight: bold; font-style: italic;">fwnode</span>;
          <span style="font-weight: bold;">enum</span> <span style="font-weight: bold; text-decoration: underline;">irq_domain_bus_token</span>     <span style="font-weight: bold; font-style: italic;">bus_token</span>;
          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">irq_domain_chip_generic</span>        *<span style="font-weight: bold; font-style: italic;">gc</span>;
          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">device</span>                 *<span style="font-weight: bold; font-style: italic;">dev</span>;
          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">device</span>                 *<span style="font-weight: bold; font-style: italic;">pm_dev</span>;
<span style="font-weight: bold;">  #ifdef</span>        CONFIG_IRQ_DOMAIN_HIERARCHY
          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">irq_domain</span>             *<span style="font-weight: bold; font-style: italic;">parent</span>;
<span style="font-weight: bold;">  #endif</span>
<span style="font-weight: bold;">  #ifdef</span> CONFIG_GENERIC_MSI_IRQ
          <span style="font-weight: bold;">const</span> <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">msi_parent_ops</span>   *<span style="font-weight: bold; font-style: italic;">msi_parent_ops</span>;
<span style="font-weight: bold;">  #endif</span>

          <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">reverse map data. The linear map gets appended to the irq_domain</span><span style="font-weight: bold; font-style: italic;"> */</span>
          <span style="font-weight: bold; text-decoration: underline;">irq_hw_number_t</span>                       <span style="font-weight: bold; font-style: italic;">hwirq_max</span>;
          <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span>                  <span style="font-weight: bold; font-style: italic;">revmap_size</span>;
          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">radix_tree_root</span>                <span style="font-weight: bold; font-style: italic;">revmap_tree</span>;
          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">irq_data</span> <span style="font-weight: bold; font-style: italic;">__rcu</span>         *revmap[] __counted_by(revmap_size);
  };

</pre>
</div>
<div id="outline-container-orgdef8373" class="outline-2">
<h2 id="orgdef8373"><span class="section-number-2">1.</span> OF-dts对interrupt-map/parent的解析</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>devicetree中实现了逻辑中断树，代表了hierarchy and routing of interrupts in the platform hardware.</li>
<li>设备节点中的interrupt-parent对应了物理中的中断线，代表了source-&gt;controller的连接.</li>
<li>如果节点没有interrupt-parent,则假设其parent是设备树中的parent.</li>
<li>controller称为域，一个域一个#interrupt-cells用来表述interrupts=&lt;&gt;;</li>
<li>虽然gpiochip往往只有一个中断线输出，但因为其往往有多个中断输入，因此gpiochip也是一个中断域.</li>
<li>interrupt nexus定义了中断域之间的翻译表，由interrupt-map定义.</li>
<li>interrupt controller属性：interrupt-cells &amp; interrupt-controller</li>
<li>interrupt nexus属性：interrupt-cells &amp; interrupt-map &amp; interrupt-map-mask</li>
<li>nexus是负责两个域之间的映射.</li>
</ol>

<p>
Interrupt Nexus Introduce:
</p>
<div class="org-src-container">
<pre class="src src-dts">  axi@18000000 {
		compatible = "brcm,bus-axi";
		reg = &lt;0x18000000 0x1000&gt;;
		ranges = &lt;0x00000000 0x18000000 0x00100000&gt;;
		#address-cells = &lt;1&gt;;
		#size-cells = &lt;1&gt;;

		#interrupt-cells = &lt;1&gt;;
		interrupt-map-mask = &lt;0x000fffff 0xffff&gt;;
		interrupt-map =
                        &lt;child_unit_address child_interrupt_specifier interrupt-parent
                        parent-unit-address parent-interrupt-specifier&gt;,
			/* ChipCommon */
			&lt;0x00000000 0 &amp;gic GIC_SPI 85 IRQ_TYPE_LEVEL_HIGH&gt;,
                    
			/* PCIe Controller 0 */
			&lt;0x00012000 0 &amp;gic GIC_SPI 126 IRQ_TYPE_LEVEL_HIGH&gt;,
			&lt;0x00012000 1 &amp;gic GIC_SPI 127 IRQ_TYPE_LEVEL_HIGH&gt;,
			&lt;0x00012000 2 &amp;gic GIC_SPI 128 IRQ_TYPE_LEVEL_HIGH&gt;,
			&lt;0x00012000 3 &amp;gic GIC_SPI 129 IRQ_TYPE_LEVEL_HIGH&gt;,
			&lt;0x00012000 4 &amp;gic GIC_SPI 130 IRQ_TYPE_LEVEL_HIGH&gt;,
			&lt;0x00012000 5 &amp;gic GIC_SPI 131 IRQ_TYPE_LEVEL_HIGH&gt;;

		chipcommon: chipcommon@0 {
			reg = &lt;0x00000000 0x1000&gt;;
			gpio-controller;
			#gpio-cells = &lt;2&gt;;
			interrupt-controller;
			#interrupt-cells = &lt;2&gt;;
		};
		pcie0: pcie@12000 {
			reg = &lt;0x00012000 0x1000&gt;;
			#address-cells = &lt;3&gt;;
			#size-cells = &lt;2&gt;;
		};
	};
</pre>
</div>
<p>
&lt;child_unit_address child_interrupt_specifier interrupt-parent
parent-unit-address parent-interrupt-specifier&gt;:
child_unit_address: 被映射的子节点的单元地址, 32bit，个数由子节点所在总线的#address-cells属性决定。在这里也就是axi bus,所以个数为1.
child_interrupt_specifier: 被映射子节点的中断描述符。32bit，个数由nexus的#interrupt-cells决定，此处也是1.
interrupt_parent: 指向interrupt parent，也就是子域指向的父域.
parent_unit_address + parent_interrupt_specifier + parent_interrupt_specifier:
就是我们常写在中断源节点中的interrupts = &lt;&gt;;也就配合interrupt_parent，指明了映射目标所在的域以及具体的中断描述符。
</p>

<p>
child_unit_address + child_interrupt_secifier:
就是指明了被映射的源节点以及具体的源中断描述符
</p>
</div>
</div>
<div id="outline-container-orgf576891" class="outline-2">
<h2 id="orgf576891"><span class="section-number-2">2.</span> 通用接口层</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
